1s/ERP/Conf/Documents/Лико_ЗаказНаРаскрой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаказНаРаскрой</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_РаскройМатериаловПланФакт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ЭтапыВыполненияЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураВыпуск</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочныйМетражРезки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодрезкаКромка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлениеРоликов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативРезки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполненияПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаскройСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>140</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусыЗаказовБЭ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполненияПланВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПараметрыРасчетаРаскрояМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНастройкиПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНастройкиПланВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРаботыПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРаботыПланВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериалНаМашине</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_ОбъектРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Раскрой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРоликов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаРолика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СнятьРезерв</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеПоРаскрою</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Печатник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетражПоЗаказу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПечати</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБланка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ТоварыКРаспределению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ТоварыКРаспределению</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоРаспределено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУУРаспределено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник, получивший объекты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПроката</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СИМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыВПути</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаказНаРаскрой/Ext/ManagerModule.bsl
#Область Проведение

#КонецОбласти

#Область Отчеты

/// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
		
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//// Задание складскому работнику
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПечатьДокумента";
	//КомандаПечати.Представление = НСтр("ru = 'Печать документа'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	////КомандаПечати.СразуНаПринтер = Истина;	
	//
	
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьДокумента") Тогда
		
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		//	КоллекцияПечатныхФорм,
		//	"ПечатьДокумента",
		//	НСтр("ru = 'ПечатьДокумента'"),
		//	ПечатьЗадания(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЗадания(МассивОбъектов, ОбъектыПечати)
	
КонецФункции
#КонецОбласти




Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ВидРабот");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.ВидРабот) Тогда

		ПредставлениеОперации = СписокОпераций().НайтиПоЗначению(Данные.ВидРабот);
		Если ПредставлениеОперации <> Неопределено Тогда
			ПредставлениеОперации = ПредставлениеОперации.Представление;
		Иначе
			ПредставлениеОперации = "Раскрой";
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 %2 от %3'"),
			ПредставлениеОперации,
			Данные.Номер,
			Данные.Дата);
		
	КонецЕсли;
		
КонецПроцедуры


Функция СписокОпераций() Экспорт

	СписокОпераций = Новый СписокЗначений;
	
	Раскрой							= ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.РаскройМатериала");
	Активация						= ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Активация");
	
	
		
	СписокОпераций.Добавить(Раскрой, 				НСтр("ru = 'лк Заказ на раскрой'"));
	СписокОпераций.Добавить(Активация,    		 	НСтр("ru = 'лк Заказ на активацию'"));
	
	
		
	Возврат СписокОпераций;

КонецФункции


Процедура СоздатьПоЗаказуКлиента(ЗаказКлиента, РабочийЦентр,Метраж) Экспорт

ЗаказНаРаскрой=НайтиЗаказНаРаскройПоЗаказуКлиента(ЗаказКлиента); 

	Если ТипЗнч(ЗаказНаРаскрой)=Тип("ДокументСсылка.Лико_ЗаказНаРаскрой") Тогда
		ДокОбъект=ЗаказНаРаскрой.ПолучитьОбъект();
	Иначе
		ДокОбъект=Документы.Лико_ЗаказНаРаскрой.СоздатьДокумент(); 
		ДокОбъект.АвторДокумента=ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
		ДокОбъект.Ответственный=ПараметрыСеанса.ТекущийПользователь;
		ДокОбъект.Состояние=Справочники.Лико_ЭтапыВыполненияЗаказа.Производство;

	КонецЕсли; 
	Если РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.Rotomec  Тогда
		 РабочийЦентрЗаказаНаРаскрой=Справочники.РабочиеЦентры.НайтиПоНаименованию("Резак Peter Shmits");
	 Иначе
		 РабочийЦентрЗаказаНаРаскрой=РабочийЦентр; 
	КонецЕсли;
	
	ДокОбъект.ПометкаУдаления	=Ложь;
	ДокОбъект.ЗаказКлиента		=ЗаказКлиента;
	ДокОбъект.РабочийЦентр		=РабочийЦентрЗаказаНаРаскрой;
	ДокОбъект.КоличествоУпаковок=Метраж;
	ДокОбъект.Нарезка			=Неопределено;
	ДокОбъект.Номенклатура		=ПолучитьНоменклатуруПолуфабриката(ЗаказКлиента);
	ДокОбъект.Организация		=ЗаказКлиента.Площадка.Организация;
	ДокОбъект.Дата				=ТекущаяДата();
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);




КонецПроцедуры


Функция НайтиЗаказНаРаскройПоЗаказуКлиента(ЗаказКлиента) //+Лико m.shenderov 20.06.2022

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗаказНаРаскрой.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ЗаказНаРаскрой КАК Лико_ЗаказНаРаскрой
	|ГДЕ
	|	Лико_ЗаказНаРаскрой.ЗаказКлиента = &ЗаказКлиента";
	Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента );
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
	    Возврат Выборка.Ссылка;
	КонецЦикла; 


		
КонецФункции //-Лико m.shenderov 20.06.2022
 
 Функция ПолучитьНоменклатуруПолуфабриката(ЗаказКлиента) Экспорт  
	 УстановитьПривилегированныйРежим(Истина);
	 НомерЗаказа=ЗаказКлиента.НомерБезПрефикса;
	 МенеджерЗаказа=ЗаказКлиента.Менеджер;
	 МассивСозданныхОбъектов = Новый Массив;
	 
	 Запрос=Новый Запрос;
	 
	 Запрос.Текст ="ВЫБРАТЬ
	 |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	 |	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура
	 |ИЗ
	 |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	 |ГДЕ
	 |	ХарактеристикиНоменклатуры.Лико_ЗаказНоменклатуры = &Заказ
	 |	И ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры = &ВидНоменклатуры";
	 
	 Запрос.УстановитьПараметр("Заказ",ЗаказКлиента);
	 Запрос.УстановитьПараметр("ВидНоменклатуры", Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 НоменклатураНезавершенка = Неопределено;
	 ХарактеристикаНезавершенка = Неопределено;
	 
	 //=--------- создаем незавершенку -----
	 РодительНезавершенкаНоменклатура = Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
	 РодительНезавершенка = Справочники.Лико_ПредопределенныеЗначения.ГруппаОбъектовНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
	 
	 Если Не РезультатЗапроса.Пустой() Тогда
		 ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		 ВыборкаЗапроса.Следующий();
		 
		 ХарактеристикаНезавершенка = ВыборкаЗапроса.Характеристика;
		 НоменклатураНезавершенка = ХарактеристикаНезавершенка.Владелец;
	 Иначе 	//запрос пуст!
		 
		 Если ЗначениеЗаполнено(МенеджерЗаказа) Тогда
			 ФИО = МенеджерЗаказа.Наименование;
			 Фамилия		= ВыделитьСлово(ФИО);
			 Имя			= ВыделитьСлово(ФИО);
			 Отчество	= ВыделитьСлово(ФИО);
			 ФИОСтрока = Фамилия+" "+Лев(имя,1)+"."+Лев(Отчество,1)+".";
		 Иначе
			 ФИОСтрока = "";
		 КонецЕсли;
		 //---------=
		 
		 Номенклатура1С = Справочники.Номенклатура.СоздатьЭлемент();
		 Номенклатура1С.УстановитьНовыйКод("n");
		 Номенклатура1С.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра;
		 Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(Номенклатура1С);
		 
		 Номенклатура1С.Наименование = "Незавершенное производство по заказу №" + Формат(НомерЗаказа, "ЧГ=0") + " (" + ФИОСтрока + ")";
		 Номенклатура1С.НаименованиеПолное = Номенклатура1С.Наименование;
		 
		 Если Не РодительНезавершенкаНоменклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			 Номенклатура1С.Родитель = РодительНезавершенкаНоменклатура;			
		 КонецЕсли;
		 Номенклатура1С.Записать();
		 
		 НоменклатураНезавершенка = Номенклатура1С.Ссылка;
		 
		 ХарактеристикаНезавершенкаОбъект=Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		 ХарактеристикаНезавершенкаОбъект.Владелец=НоменклатураНезавершенка;
		 ХарактеристикаНезавершенкаОбъект.Лико_ЗаказНоменклатуры=ЗаказКлиента;
		 ХарактеристикаНезавершенкаОбъект.Записать();
		 ХарактеристикаНезавершенка=ХарактеристикаНезавершенкаОбъект.Ссылка;
	 КонецЕсли;
	 
	 Возврат НоменклатураНезавершенка;
	 
 КонецФункции //СоздатьОбъектыНоменклатуры
 
 
/// Функция выделяет первое слово в предложении
Функция ВыделитьСлово(ИсходнаяСтрока) Экспорт
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");
	
	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции



Функция ПЗВ() Экспорт  //+Лико m.shenderov 21.06.2022
	
	Результат= Справочники.Лико_ПредопределенныеЗначения.ПЗВ_Резка.ЗначениеПараметра;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат=30;
	КонецЕсли;
	
	
	Возврат Результат;	
	
КонецФункции //-Лико m.shenderov 21.06.2022 

Функция ПЗВПереворот() Экспорт  //+Лико m.shenderov 21.06.2022
	
	Результат= 15;
	
	Возврат Результат;	
	
КонецФункции //-Лико m.shenderov 21.06.2022 


Функция СредняяДлинаРоика() Экспорт  //+Лико m.shenderov 24.06.2022
	Возврат 4000;	
КонецФункции //-Лико m.shenderov 24.06.2022 

Функция ФорматироватьЧислоКакВремя(ЧислоВремя) Экспорт  //+Лико m.shenderov 15.06.2022
	
	Часы	= Цел(ЧислоВремя);
	Мин	= (((ЧислоВремя*60))%60)/100;
	Возврат Часы+Мин;  
	
	
КонецФункции  //-Лико m.shenderov 15.06.2022

Функция РасчитатьВремяВыполнения(Заказ,КоличествоУпаковок=Неопределено,Правило=Неопределено) Экспорт  //+Лико m.shenderov 10.07.2022
	
	Если Правило=Неопределено Тогда
		Правило=Заказ.Правило;
	КонецЕсли;
	
	Если КоличествоУпаковок=Неопределено Тогда
	КоличествоУпаковок=Заказ.КоличествоУпаковок;
	КонецЕсли;
	
		Структура = Новый Структура;
		Структура.Вставить("ВремяВыполненияПлан",0);
		Структура.Вставить("ВремяВыполненияПланВремя",0);
		Если ЗначениеЗаполнено(Правило) Тогда
		ПЗВ=Документы.Лико_ЗаказНаРаскрой.ПЗВ();
		
		КоличествоРоликов=Заказ.Раскрой.Итог("КоличествоРоликов");  
		
		Если КоличествоРоликов=0  Тогда   	
			СредняяДлинаРолика=Документы.Лико_ЗаказНаРаскрой.СредняяДлинаРоика(); 
			КоличествоРоликов=Окр(Заказ.КоличествоУпаковок/СредняяДлинаРолика)*Заказ.ЗаказКлиента.РучьиПечати; 
			КоличествоНожей= КоличествоРоликов+?(Заказ.ПодрезкаКромка,1,-1); 

		Иначе   		   
			СредняяДлинаРолика=КоличествоУпаковок/КоличествоРоликов; 
		КонецЕсли;
		Попытка
			
			ВремяРезкиМин=ПЗВ+
			КоличествоУпаковок/Правило.Скорость+
			КоличествоУпаковок/СредняяДлинаРолика*(Правило.ВремяСъема+КоличествоРоликов*Правило.ВремяРолика)+
			КоличествоУпаковок/Правило.ДлинаЮмбы*Правило.ВремяЮмбы+
			(КоличествоРоликов+1)*Правило.ВремяНастройкиНожей;
			Структура.ВремяВыполненияПлан=ВремяРезкиМин/60;
			Структура.ВремяВыполненияПланВремя=Документы.Лико_ЗаказНаРаскрой.ФорматироватьЧислоКакВремя(Структура.ВремяВыполненияПлан);
		Исключение
			//ОписаниеОшибки()
		КонецПопытки;
        КонецЕсли;
	     Возврат Структура;
	
КонецФункции //-Лико m.shenderov 10.07.2022 

Функция ЗаполнитьСтруктуруПоЗаказуКлиента(ЗаказКлиента,РабочийЦентр,Метраж) Экспорт //+Лико m.shenderov 20.06.2022
	
	Структура = Новый Структура;
	
	Структура.Вставить("ЗаказКлиента"	    ,ЗаказКлиента);
	Структура.Вставить("РабочийЦентр"		,РабочийЦентр);
	Структура.Вставить("КоличествоУпаковок" ,Метраж);
	Структура.Вставить("Нарезка"			,Неопределено);
	Структура.Вставить("Номенклатура"		,ПолучитьНоменклатуруПолуфабриката(ЗаказКлиента));
	Структура.Вставить("Организация"		,ЗаказКлиента.Площадка.Организация);
	Возврат Структура;
	
		
КонецФункции //-Лико m.shenderov 20.06.2022


Функция ПолучитьДанныеЗаказуКлиента(ЗаказКлиента) Экспорт //+Лико m.shenderov 18.07.2022
	
		ЗапросРезка = Новый Запрос; 
			ЗапросРезка.Текст = 
			"ВЫБРАТЬ
			|	Лико_ПараметрыПроизводстваЗаказа.Заказ КАК Заказ,
			|	Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр КАК РабочийЦентр,
			|	Лико_ПараметрыПроизводстваЗаказа.НомерПроката КАК НомерПроката,
			|	СУММА(Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ) КАК Метраж
			|ИЗ
			|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
			|ГДЕ
			|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
			|	И Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр.ВидРабочегоЦентра В(ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПродольнаяРезка),ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Rotomec))
			|
			|СГРУППИРОВАТЬ ПО
			|	Лико_ПараметрыПроизводстваЗаказа.Заказ,
			|	Лико_ПараметрыПроизводстваЗаказа.РабочийЦентр,
			|	Лико_ПараметрыПроизводстваЗаказа.НомерПроката";
			ЗапросРезка.УстановитьПараметр("Заказ", ЗаказКлиента);
			ВыборкаРезка = ЗапросРезка.Выполнить().Выбрать();
           	Пока ВыборкаРезка.Следующий() Цикл
				Возврат ЗаполнитьСтруктуруПоЗаказуКлиента(ЗаказКлиента,ВыборкаРезка.РабочийЦентр,ВыборкаРезка.Метраж);
			КонецЦикла;

	      	
КонецФункции //-Лико m.shenderov 18.07.2022 

Функция ПолучитьСтатистикуПоНарезке(Организация,Номенклатура,КолМес=3) Экспорт //+Лико m.shenderov 02.10.2023
	ДатаОкончания=ТекущаяДата();
	
	ДатаНачала=ДатаОкончания-КолМес*30*24*60*60;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ТоварыКРаспределениюОбороты.Номенклатура КАК Номенклатура,
	|	Лико_ТоварыКРаспределениюОбороты.Характеристика.ЯССМ_Нарезка КАК Нарезка,
	|	Лико_ТоварыКРаспределениюОбороты.КоличествоОборот / &КолМес КАК СреднийРасходЗаМесяц,
	|	Лико_ТоварыКРаспределениюОбороты.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	РегистрНакопления.Лико_ТоварыКРаспределению.Обороты(
	|			&Дата1,
	|			&Дата2,
	|			,
	|			Номенклатура = &Номенклатура
	|				И РабочийЦентр.Лико_Площадка.Организация = &Организация
	|				И НЕ РабочийЦентр.Лико_Резак) КАК Лико_ТоварыКРаспределениюОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	|ПОМЕСТИТЬ ВременнаяТаблица1
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			(Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Вт.Номенклатура,
	|						Вт.Характеристика
	|					ИЗ
	|						ВременнаяТаблица КАК Вт)
	|				И Ячейка.Помещение.Лико_Организация = &Организация
	|				И Ячейка.Помещение.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.Сим)
	|				И НЕ Ячейка.Помещение.Лико_ПомещениеБрака) КАК ТоварыВЯчейкахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблица.Характеристика КАК Характеристика,
	|	ВременнаяТаблица.Нарезка КАК Нарезка,
	|	ВременнаяТаблица.СреднийРасходЗаМесяц КАК СреднийРасходЗаМесяц,
	|	ЕСТЬNULL(ВременнаяТаблица1.ВНаличииОстаток, 0) КАК Остаток,
	|	ВременнаяТаблица.СреднийРасходЗаМесяц - ЕСТЬNULL(ВременнаяТаблица1.ВНаличииОстаток, 0) КАК Потребность,
	|	ВременнаяТаблица.Нарезка.Размер КАК НарезкаРазмер
	|ИЗ
	|	ВременнаяТаблица1 КАК ВременнаяТаблица1
	|		ПРАВОЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|		ПО (ВременнаяТаблица.Номенклатура = ВременнаяТаблица1.Номенклатура)
	|			И (ВременнаяТаблица.Характеристика = ВременнаяТаблица1.Характеристика)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НарезкаРазмер";
	Запрос.УстановитьПараметр("Дата1",ДатаНачала ); 
	Запрос.УстановитьПараметр("Дата2",ДатаОкончания ); 
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура ); 
	Запрос.УстановитьПараметр("Организация",Организация ); 
	Запрос.УстановитьПараметр("КолМес",КолМес ); 
	
	Возврат Запрос.Выполнить();
	

	РезультатЗапроса = Запрос.Выполнить();
	
	
	
	
КонецФункции //-Лико m.shenderov 02.10.2023
